---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailingPlacementPosition.Treads
enum: Autodesk.Revit.DB.Architecture.RailingPlacementPosition
source: html/893811f2-d3ba-8ef4-a397-322416cfcbfd.htm
---
# Autodesk.Revit.DB.Architecture.RailingPlacementPosition.Treads

Places railing on treads.